# Data Frames

Data frames are data structures which provide intuitive ways of handling data best represented in table-like form. They are a standard data type in R, using the well-maintained PANDAS package in python, and are referred to as a Table data structure in Matlab. Although there are other ways of handling data, data frames are particularly designed for common analysis operations on rows or columns, as we will see. File-based input and output of data is discussed at the end.

## Demo instructions:
1. A brief 1-2 paragraph overview of data frames in the language.
2. Create a data frame from scratch using hardcoded tabular data (consider something that parses multiline strings perhaps)
3. Select by row or by column
    - by column name or by row index
    - by numerical order (e.g. first or last)
4. Delete rows or columns by index and name
5. Select, delete, or change values using boolean indexing
6. Creating new columns through
    - Simple operations on previous columns (e.g. simple math operations)
    - Standard summary functions (e.g. sum, mean, std dev)
    - The map/apply function (advanced)
7. Grouped calculations (e.g. average of values in column Y for all x values in column X)
8. Handle missing data by (advanced)
    - Removing the rows with missing data
    - Filling with a specific value
    - Filling with a computed value (e.g. a median of known values)
9. Output data in CSV format
10. Reading data (from before) in using CSV format.

### Helpful [table](http://pandas.pydata.org/pandas-docs/stable/comparison_with_r.html) to compare Python and R data frames directly.

# Solutions:

## 1. Paragraph Overview

Python has a great library for working flexibly and effectively with table-like data sets - data with rows and columns; it's called the Pandas library! The Pandas library provides useful tools for data manipulation and analysis. These tools include the ability to read and write CSV and Excel files, access/update/remove elements by row or column by name or location, performing operations in bulk without looping, etc. There are a few data structures that can be found in the Pandas library, the most central of which is the DataFrame. 
Data frames are two-dimensional labeled data structures with columns that can be of different types; for one-dimensional data the Series structure is sometimes used. Data frames are commonly used to represent tabular data, so the data can be organized accordingly and used efficiently for analysis. We will focus on data frames in this section, so let's get started with the creation of this awesome data structure!
If you want to know more about PANDAS, the following link is the API reference
https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

## 2. Create a data frame from scratch

In this section, we will use hard-coded data to create a data frame using the Pandas library. I will use data that represents the sales information for 3 cars over 5 months. I will be using dictionaries to represent the data, and the keys of these dictionaries will be the column headings.

In [1]:
import pandas as pd
import numpy as np

#Hard-coded data for output represents the sales per 5 months for 3 types of cars 
companySales = {'Months':['January','February','March','April','May'], 
                'Tesla Model 5' : [900,1750,3450,1125,1620], 
                'Kia Soul EV': [117,152,171,167,129], 
                'BMW I3':[382,318,703,516,506]}

#Creates a data frame with the correct order of columns 
df = pd.DataFrame(companySales,columns=["Months","Tesla Model 5","Kia Soul EV","BMW I3"])

#Prints out the table
print(df)

     Months  Tesla Model 5  Kia Soul EV  BMW I3
0   January            900          117     382
1  February           1750          152     318
2     March           3450          171     703
3     April           1125          167     516
4       May           1620          129     506

## 3. Select by row or by column
### 3.A. Row
#### 3.A.1. Row Location (e.g. first, second, last)

These two pieces of code will choose the data in the first and the last rows of the data frame.

In [2]:
#Accessing the data in the first row
print("----First month----")
print(df.iloc[0])

#Accessing the data in the last row
print("----Last month----")
print(df.iloc[-1])

----First month----
Months           January
Tesla Model 5        900
Kia Soul EV          117
BMW I3               382
Name: 0, dtype: object
----Last month----
Months            May
Tesla Model 5    1620
Kia Soul EV       129
BMW I3            506
Name: 4, dtype: object

#### 3.A.2. Row label (a.k.a index)

We can also select the data in a row by specifying the label of the row. This is less common in practice than using column names since it is only useful when each row has a specific label that is unique. Unless otherwise specified like the code below, the label of a row is by default the index, but this can be changed as in the example below.

In [3]:
# Changes the name of the rows/indices
# Now the row can be referred by a label rather than position
df.index = ["January","February","March","April","May"]

# Show the row labeled “February” from the data frame
df.loc["February"]

Months           February
Tesla Model 5        1750
Kia Soul EV           152
BMW I3                318
Name: February, dtype: object

### 3.B. Column
#### 3.B.1. Column name

With this code, we will be able to show only the data in a certain column by specifying the column's name. Note, to select multiple columns simultaneously, you can use a list of strings (e.g. df[[“Months, “BMW I3”]]) rather than a single column name.

In [4]:
df["BMW I3"]

January     382
February    318
March       703
April       516
May         506
Name: BMW I3, dtype: int64

## 4. Delete rows or columns by name or index
### 4.A. Deleting columns
#### 4.A.1. By name

This code will delete the column with the heading "BMW I3". Axis=1 specifies that you want to manipulate the columns of the data frame; by default, the parameter axis is equal to 0, which means that computations are performed along the rows.

In [5]:
df.drop(["BMW I3"],axis = 1)

            Months  Tesla Model 5  Kia Soul EV
January    January            900          117
February  February           1750          152
March        March           3450          171
April        April           1125          167
May            May           1620          129

### 4.B. Deleting rows
#### 4.B.1. By label 

This piece of code will delete the row labeled “January” from the data frame. We will recreate the data frame to demonstrate this.

In [6]:
#Hard-coded data for output
#This data represents the sales per 5 months for 3 types of cars 
carSales = {'Tesla Model 5' : [900,1750,3450,1125,1620], 'Kia Soul EV': [117,152,171,167,129], 'BMW I3':[900,1750,3450,1125,1620]}

#Creates a data frame with the correct order of columns 
df_cars = pd.DataFrame(carSales,columns=["Tesla Model 5","Kia Soul EV","BMW I3"])

#Changes the name of the rows/indices
#now the row can be referred by a label rather than position
df_cars.index = ["January","February","March","April","May"]

print(df_cars)

print()
print('---------Deleting row "January"----------')
print()

#Removes the row labeled “January” from the data frame
print(df_cars.drop(["January"]))

          Tesla Model 5  Kia Soul EV  BMW I3
January             900          117     900
February           1750          152    1750
March              3450          171    3450
April              1125          167    1125
May                1620          129    1620

---------Deleting row "January"----------

          Tesla Model 5  Kia Soul EV  BMW I3
February           1750          152    1750
March              3450          171    3450
April              1125          167    1125
May                1620          129    1620

#### 4.B.2. By index

This code will delete the second row in the data frame named df_cars by finding the index (a.k.a. label) of the second row.

In [7]:
df_cars.drop(df_cars.index[1])

         Tesla Model 5  Kia Soul EV  BMW I3
January            900          117     900
March             3450          171    3450
April             1125          167    1125
May               1620          129    1620

## 5. Select, delete or change using boolean Indexing
### 5.A. Selecting and removing data in a row based on value in a column

This line of code will delete any rows that have values that are greater than 2000. You could replace the String inside the [ ] with any column or row headings as long as those rows or columns contain integers. 
Note, df.loc[boolean] may also be used instead of df[boolean] syntax. They perform similarly.

In [8]:
#Hard-coded data for output
#This data represents the sales per 5 months for 3 types of cars 
companySales = {'Months':['January','February','March','April','May'], 
                'Tesla Model 5' : [900,1750,3450,1125,1620], 
                'Kia Soul EV': [117,152,171,167,129], 
                'BMW I3':[382,318,703,516,506]}

#Creates a data frame with the correct order of columns 
df = pd.DataFrame(companySales,columns=["Months","Tesla Model 5","Kia Soul EV","BMW I3"])

#Prints out the table
print(df)

print('\n-----Using boolean indexing-----\n')

#removes any rows that contain values greater than 2000
new_df = df[df["Tesla Model 5"] < 2000 ]
print(new_df)

     Months  Tesla Model 5  Kia Soul EV  BMW I3
0   January            900          117     382
1  February           1750          152     318
2     March           3450          171     703
3     April           1125          167     516
4       May           1620          129     506

-----Using boolean indexing-----

     Months  Tesla Model 5  Kia Soul EV  BMW I3
0   January            900          117     382
1  February           1750          152     318
3     April           1125          167     516
4       May           1620          129     506

### 5.B. More selection using boolean indexing

In [9]:
#Selects data in a column by using boolean indexing
#Selects the columns where Tesla Model 5 is greater than 1000 & BMW I3 is less than 1500
new_df = df[(df['Tesla Model 5'] > 1500) & (df['BMW I3'] < 600)]
print(new_df)

     Months  Tesla Model 5  Kia Soul EV  BMW I3
1  February           1750          152     318
4       May           1620          129     506

## 6. Creating new columns through: 
### 6.A. Simple operations on previous columns (+,-,* on current columns)

If you want to create a new column from data in the table, and all the operations are simple math operations, the syntax is relatively straightforward.
For example, if you want to add a new column 'Average' showing the average model cost for each month

In [10]:
df['Monthly Average'] = (df['Tesla Model 5'] + df['Kia Soul EV'] + df['BMW I3']) / 3
print(df)

     Months  Tesla Model 5  Kia Soul EV  BMW I3  Monthly Average
0   January            900          117     382       466.333333
1  February           1750          152     318       740.000000
2     March           3450          171     703      1441.333333
3     April           1125          167     516       602.666667
4       May           1620          129     506       751.666667

### 6.B. Standard summary functions (e.g. mean, sum)

Because mean is a standard function, this can also be done by usng the mean function of Python.

In [11]:
# Computing the average amount of cars sold each month
df["Monthly Average"] = df.mean(axis=1)
print(df)

# Can compare this example to the example above to see 
# how both techniques can be used to achieve the same result

     Months  Tesla Model 5  Kia Soul EV  BMW I3  Monthly Average
0   January            900          117     382       466.333333
1  February           1750          152     318       740.000000
2     March           3450          171     703      1441.333333
3     April           1125          167     516       602.666667
4       May           1620          129     506       751.666667

### 6.C. The map/apply function (advanced)

We will be creating a column that represents the graduation years of the various students based on their grade levels! This code creates a function with multiple conditional statements to determine the graduation years for the different grade levels.

In [12]:
#Hard-coded data for output
#This data will give important information about 4 students  
studentInformation = {'Students':['Marley Stevens', 'Emily Brookes','John Garcia','Steven Kosner'], 
                      'ID' : [1568921,1389012,1467892,1789021], 
                      'Grade Level': ['Sophomore','Sophomore','Freshman','Senior'], 
                      'Major':['Computer Science','Dance','English','Mathematics']}

#Creates a data frame with the correct order of columns 
df_students = pd.DataFrame(studentInformation,columns=["Students","ID","Grade Level","Major"])

#Creates a function to assign graduation years to the various grade levels of the studenta
def label_graduation(row):
    if row["Grade Level"]== "Freshman":
        return 2021
    if row["Grade Level"]=="Sophomore":
        return 2020
    if row["Grade Level"]== "Junior":
        return 2019
    if row["Grade Level"]=="Senior":
        return 2018

#Creates a new column to represent the graduation years of the students
df_students["Graduation Year"]=df_students.apply(label_graduation,axis=1)

print(df_students)

         Students       ID Grade Level             Major  Graduation Year
0  Marley Stevens  1568921   Sophomore  Computer Science             2020
1   Emily Brookes  1389012   Sophomore             Dance             2020
2     John Garcia  1467892    Freshman           English             2021
3   Steven Kosner  1789021      Senior       Mathematics             2018

## 7. Grouped Calculations (groupby)

Grouped calculations are able to perform computations on a column, but only for a subset of rows. To show this behavior, we will create a new DataFrame.

In [13]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
            'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

If you want to show the average number of points scored each year...

In [14]:
grouped = df.groupby('Year')
print (grouped['Points'].mean())

print()

##This can also be done in one line
print(df.groupby('Year')['Points'].mean())

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

Similar functions to mean that work on entire columns are max, min, median, sum, std, var, and count.

## 8. Handle missing data (advanced)
### Creating a dataframe with missing data

This code will create a dataframe with missing data, which is represented by the value NaN (Not a Number).

In [15]:
#Handling missing data
#This data frame is created with missing data represented by np.nan
raw_data = {'First Name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'Last Name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
        'Age': [42, np.nan, 36, 24, 73], 
        'Sex': ['m', np.nan, 'f', 'm', 'f'], 
        'Pre Test-score': [4, np.nan, np.nan, 2, 3],
        'Post Test-score': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['First Name', 'Last Name', 'Age', 
                                       'Sex', 'Pre Test-score', 'Post Test-score'])

print(df)

  First Name Last Name   Age  Sex  Pre Test-score  Post Test-score
0      Jason    Miller  42.0    m             4.0             25.0
1        NaN       NaN   NaN  NaN             NaN              NaN
2       Tina       Ali  36.0    f             NaN              NaN
3       Jake    Milner  24.0    m             2.0             62.0
4        Amy     Cooze  73.0    f             3.0             70.0

### 8.A. Removing any rows with missing data

This code will be used to remove any rows with NaN values.

In [16]:
#Removing rows with missing data
df_no_missing = df.dropna()

##We can just use the name of the data frame to print its values
df_no_missing

  First Name Last Name   Age Sex  Pre Test-score  Post Test-score
0      Jason    Miller  42.0   m             4.0             25.0
3       Jake    Milner  24.0   m             2.0             62.0
4        Amy     Cooze  73.0   f             3.0             70.0

### 8.B. Filling a missing value with a specific value

The function fillna() will fill any NaN values with a specific value, such as 0.

In [17]:
#Filling missing data with a specific value
df_fill_values = df.fillna(0)
df_fill_values

  First Name Last Name   Age Sex  Pre Test-score  Post Test-score
0      Jason    Miller  42.0   m             4.0             25.0
1          0         0   0.0   0             0.0              0.0
2       Tina       Ali  36.0   f             0.0              0.0
3       Jake    Milner  24.0   m             2.0             62.0
4        Amy     Cooze  73.0   f             3.0             70.0

### 8.C. Filling missing data with a computed value

By using the fillna() function, a computed value can be used to fill any NaN values. This code will fill any NaN values in the column “preTestScore” with the mean value of “preTestScore”.

In [18]:
#This data frame is created with missing data represented by np.nan
raw_data = {'First Name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'Last Name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
        'Age': [42, np.nan, 36, 24, 73], 
        'Sex': ['m', np.nan, 'f', 'm', 'f'], 
        'Pre Test-score': [4, np.nan, np.nan, 2, 3],
        'Post Test-score': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['First Name', 'Last Name', 'Age', 
                                       'Sex', 'Pre Test-score', 'Post Test-score'])

#Fill missing in preTestScore with the mean value of #preTestScore
df["Pre Test-score"].fillna(df["Pre Test-score"].mean(),inplace=True)
print(df)

  First Name Last Name   Age  Sex  Pre Test-score  Post Test-score
0      Jason    Miller  42.0    m             4.0             25.0
1        NaN       NaN   NaN  NaN             3.0              NaN
2       Tina       Ali  36.0    f             3.0              NaN
3       Jake    Milner  24.0    m             2.0             62.0
4        Amy     Cooze  73.0    f             3.0             70.0

## 9. Output data in CSV format

This code will create a CSV file from the dataframe with missing data; it will include the labels for the columns by default and the rows in the file.

In [19]:
#Handling missing data
#This data frame is created with missing data represented by np.nan
raw_data = {'First Name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'Last Name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
        'Age': [42, np.nan, 36, 24, 73], 
        'Sex': ['m', np.nan, 'f', 'm', 'f'], 
        'Pre Test-score': [4, np.nan, np.nan, 2, 3],
        'Post Test-score': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['First Name', 'Last Name', 'Age', 'Sex',
                                       'Pre Test-score', 'Post Test-score'])


#.csv file will save to your computer
df.to_csv('test.csv',encoding='utf-8', index=False)

Read the description of the to_csv function for important options to include. 

For example, if you are writing a file and you don't want to include a header line you would use...
<b>df.to_csv('test.csv', header = None)</b>

Or if you wanted your data separated by a single space rather than commas you could use...
<b>df.to_csv('test.csv', sep = “ “).</b>

## 10. Reading data in using CSV format

This line of code will read in a CSV file and print out the dataframe.

In [20]:
#Reading from a csv file
df = pd.read_csv('test.csv')
print(df)

  First Name Last Name   Age  Sex  Pre Test-score  Post Test-score
0      Jason    Miller  42.0    m             4.0             25.0
1        NaN       NaN   NaN  NaN             NaN              NaN
2       Tina       Ali  36.0    f             NaN              NaN
3       Jake    Milner  24.0    m             2.0             62.0
4        Amy     Cooze  73.0    f             3.0             70.0

### Options for reading data using the CSV format

Read the description of the read_csv function for important options to include. For example, if you are reading in a file that does not have the first line as a header, you would use

<b>df = pd.read_csv('test.csv', header = None)</b>

Or if you wanted to redefine the headers yourself you could use

<b>df = pd.read_csv('test.csv', names = ['first','last','age','sex','pre','post'])</b>

Or if your data was separated by a single space rather than commas you could use

<b>df = pd.read_csv('test.csv', sep = " ")</b>